src/Documents/PayrollSheet.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>PayrollSheet</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountsCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Employees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountsAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/CurrencyRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>CurrencyRates</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/PayrollSheet/Forms/CurrencyForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// COMMON PROCEDURES AND FUNCTIONS

&AtServer
// Fills form parameters.
//
Procedure GetFormValuesOfParameters()
	
	DocumentCurrency				= Parameters.DocumentCurrency;
	DocumentCurrencyBeforeChange 	= Parameters.DocumentCurrency;
	AccountsCurrency				= Parameters.AccountsCurrency;
	AccountsCurrencyBeforeChange 	= Parameters.AccountsCurrency;
	ExchangeRate 					= Parameters.ExchangeRate;
	RateBeforeChange 				= Parameters.ExchangeRate;
	Multiplicity 						= Parameters.Multiplicity;
	MultiplicityBeforeChange 			= Parameters.Multiplicity;
	
	DocumentDate = Parameters.DocumentDate;
			
EndProcedure

&AtServer
// Fills the table of currency rates
//
Procedure FillExchangeRatesTable()
	
	Query = New Query;
	Query.SetParameter("DocumentDate", DocumentDate);
	Query.Text = 
	"SELECT
	|	CurrencyRatesSliceLast.Currency,
	|	CurrencyRatesSliceLast.ExchangeRate,
	|	CurrencyRatesSliceLast.Multiplicity
	|FROM
	|	InformationRegister.CurrencyRates.SliceLast(&DocumentDate, ) AS CurrencyRatesSliceLast";
	
	QueryResultTable = Query.Execute().Unload();
	CurrencyRates.Load(QueryResultTable);
	
EndProcedure

&AtClient
// Fills the document currency rate and Multiplicity.
//
Procedure FillRateMultiplicityOfAccountsCurrency()
	
	If ValueIsFilled(DocumentCurrency) Then
		ArrayRateMultiplicity = CurrencyRates.FindRows(New Structure("Currency", AccountsCurrency));
		If ValueIsFilled(ArrayRateMultiplicity) Then
			ExchangeRate = ArrayRateMultiplicity[0].ExchangeRate;
			Multiplicity = ArrayRateMultiplicity[0].Multiplicity;
		Else
			ExchangeRate = 0;
			Multiplicity = 0;
		EndIf;
	EndIf;
	
EndProcedure

&AtClient
// Checks whether form attributes are filled correctly.
//
Procedure CheckFillOfFormAttributes(Cancellation)
    	
	If NOT ValueIsFilled(DocumentCurrency) Then
		Message = New UserMessage();
		Message.Text = NStr("en = 'The currency to be filled is not selected.'");
		Message.Field = "DocumentCurrency";
		Message.Message();
		Cancellation = True;
	EndIf;
	If NOT ValueIsFilled(ExchangeRate) Then
		Message = New UserMessage();
		Message.Text = NStr("en = 'The accounting currency rate is equal to zero.'");
		Message.Field = "ExchangeRate";
		Message.Message();
		Cancellation = True;
	EndIf;
	If NOT ValueIsFilled(Multiplicity) Then
		Message = New UserMessage();
		Message.Text = NStr("en = 'The accounting currency multiplicity is equal to zero.'");
		Message.Field = "AccountsMultiplicity";
		Message.Message();
		Cancellation = True;
	EndIf;
	If NOT ValueIsFilled(AccountsCurrency) Then
		Message = New UserMessage();
		Message.Text = NStr("en = 'The accounting currency to be filled is not selected.'");
		Message.Field = "AccountsCurrency";
		Message.Message();
		Cancellation = True;
	EndIf;
	
EndProcedure

&AtClient
// Checks whether the form is modified.
//
Function CheckIfFormWasModified()

	WereMadeChanges = False;

	If RecalculatePricesByCurrency 
		OR (RateBeforeChange <> ExchangeRate)
		OR (MultiplicityBeforeChange <> Multiplicity)
		OR (AccountsCurrencyBeforeChange <> AccountsCurrency)
		OR (DocumentCurrencyBeforeChange <> DocumentCurrency) Then

        WereMadeChanges = True;

	EndIf; 
	
	Return WereMadeChanges;

EndFunction

////////////////////////////////////////////////////////////////////////////////
// FORM EVENT HANDLERS

&AtServer
// OnCreateAtServe event handler.
// Initializes form parameters.
//
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	GetFormValuesOfParameters();
	FillExchangeRatesTable();
		
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// FORM COMMAND BAR ACTION HANDLERS

&AtClient
// Cancel button click event handler.
//
Procedure CancelExecute()
	
	ReturnStructure = New Structure();
	ReturnStructure.Insert("DialogReturnCode", DialogReturnCode.Cancel);
	ReturnStructure.Insert("WereMadeChanges", False);
	Close(ReturnStructure);

EndProcedure

&AtClient
// OK button click event handler.
//
Procedure ButtOKExecute()
	
	Cancellation = False;

	CheckFillOfFormAttributes(Cancellation);
	If NOT Cancellation Then
		WereMadeChanges = CheckIfFormWasModified();
		ReturnStructure = New Structure();
		ReturnStructure.Insert("DocumentCurrency", 				DocumentCurrency);
		ReturnStructure.Insert("AccountsCurrency", 				AccountsCurrency);
		ReturnStructure.Insert("ExchangeRate", 					ExchangeRate);
		ReturnStructure.Insert("Multiplicity", 					Multiplicity);
		ReturnStructure.Insert("RecalculatePricesByCurrency", 	RecalculatePricesByCurrency);
		ReturnStructure.Insert("WereMadeChanges", 				WereMadeChanges);
		ReturnStructure.Insert("DialogReturnCode", 				DialogReturnCode.OK);
		Close(ReturnStructure);
	EndIf;

EndProcedure

////////////////////////////////////////////////////////////////////////////////
// FORM ATTRIBUTE EVENT HANDLERS

&AtClient
// Currency input field OnChange event handler.
//
Procedure CurrencyOnChange(Item)
	
	FillRateMultiplicityOfAccountsCurrency();
	If ValueIsFilled(AccountsCurrency) 
	   And AccountsCurrencyBeforeChange <> AccountsCurrency Then
  		RecalculatePricesByCurrency = True;
  	Else
  		RecalculatePricesByCurrency = False;
	EndIf;
	
EndProcedure

&AtClient
// AccountsCurrencyRate input field OnChange event handler.
//
Procedure AccountsCurrencyRateOnChange(Item)
	
	If ValueIsFilled(ExchangeRate) 
	   And RateBeforeChange <> ExchangeRate Then
		RecalculatePricesByCurrency = True;
	Else
		RecalculatePricesByCurrency = False;
	EndIf;
	
EndProcedure

&AtClient
// MultiplicityAccountsCurrencies input field OnChange event handler.
//
Procedure MultiplicityAccountsCurrenciesOnChange(Item)
	
	If ValueIsFilled(Multiplicity) 
	   And MultiplicityBeforeChange <> Multiplicity Then
		RecalculatePricesByCurrency = True;
	Else
		RecalculatePricesByCurrency = False;
	EndIf;
	
EndProcedure
